package kr.sunapse.sunflow

object BldCategoryChecker {

    private val list판매및영업시설 = listOf("근린생활시설", "점포", "제2종근린생활시설", "제1종근린생활시설", "제1", "영업용", "판매및영업시설", "소매점", "일반음식점", "제1.2종근린생활시설", "음식점", "휴게음식점", "판매및영업시설", "제조업소", "생활편익시설", "근린생활", "파출소", "은행", "2종근린생활시설", "식당", "대중음식점", "제2종근린생활시설 및 단독주택", "목욕탕", "1종근린생활시설", "근린생활시설 및 단독주택", "동사무소", "점포", "주민공동시설", "제2종 근린생활시설", "영업소", "시장", "근린생할시설", "학원", "판매 및 영업시설", "근린생활시설및단독주택", "근린생활시설 및 주택", "제2근린생활시설", "근린생활시설<소매점>", "점포<식당>", "제1종 근린생활시설", "근생시설", "다방", "변전소", "화장실", "제1종", "주민공동이용시설", "상가", "단독주택 및 제2종근린생활시설", "우체국", "주택 및 점포", "근리생활시설", "제2종근린생활시설 및 위락시설", "제1종 및 제2종근린생활시설", "쓰레기적환장", "노래연습장", "본가 및 근린생활시설", "약국", "제1.2근린생활시설", "서울역전파출소", "서울역종합분소", "동사무실", "제2종근린생활시설 및도시형생활주택", "근생", "단독주택.근린생활시설", "성서판매", ".영업용", "대중목욕탕", "사설학원", "변소", "묵정공원사무소", "생활형숙박시설 및 근린생활시설", "마을부대시설", "1", "1종 근.생", "휴게음식점/단독주택", "제1종근린생활시설.창고", "제1.2종 근린생활시설", "제1종근린생활시설및다가구주택", "유도장", "점포 및 근린생활시설", "공원파출소", "자유센타", "공중화장실", "제2종근린생활시설및공동주택", "판매", "2종근생", "외인크라부연회실", "와인크라부회의실", "한증탕", "제1종근린생활시설 및 숙박시설", "1종.2종근린생활시설", "공동목욕탕", "근린생활시설<사무소>", "영업용 사무실", "근린생활시설외4", "근란생활시설", "근린생활시설.점포", "근린생활시설<일반음식점>", "근린생활시설및주택", "을지로3가파출소", "탕옥", "인쇄소", "제1종근린생활시설및", "제2동근린생활시설", "제1종근린생활시설 및 도시형생활주택", "근생및다중주택6호", "제1종근린생황시설", "공중변소", "주민센터", "경찰서", "근린생활시설 및 오피스텔", "근생시설/다세대주택", "제1·2종근린생활시설및 교육연구시설및복지시설", "대피소", "문화및집회시설 근린생활시설", "근린생활시설 및 다세대주택", "금융업소", "제2종근생활시설", "제1·2종근린생활시설", "단독주택.제1종근린생활시설", "회관", "근린생활시설 및 다가구주택", "근린생활시설및다가구주택", "근.생및다가구주택", "근생및단독", "제2종근생 및 다세대주택", "근린생활시설및 다세대주택", "미술관및근린생활시설", "근린생활시설/단독주택", "문고", "오픈키친", "숙박시설및근린생활시설", "1종", "제1종근린생활시설 및 주택", "창고시설 및 근린생활시설", "일반 음식점", "근생.주택", "근생및다가구주택", "오피스텔 및 제2종근린생활시설", "근린생활시설 및 도시형생활형주택", "일반업무시설/제1", "일반점포", "관사", "마을공동시설")
    private val list창고시설 = listOf("창고", "창고시설", "서울역화물중계실", "비품창고", "일반창고", "창고", "무인택배함실", "세대창고", "창고 시설")
    private val list종교시설 = listOf("종교시설", "교회", "종교집회장", "수도원", "예배당", "선교회관", "교회당", "종교건물", "수녀원기숙사")
    private val list자동차관련시설 = listOf("자동차관련시설", "주차장", "지하주차장", "차고", "주차관련시설", "기계식주차장", "운전보안시설", "자동차 관련시설", "부설주차장", "공영주차장", "지하주차장 및 주민공동시설", "차량대기소")
    private val list의료시설 = listOf("병원", "의원", "의료시설", "제2병실")
    private val list위험물저장및처리시설 = listOf("위험물저장및처리시설", "위험물저장 및 처리시설", "폐수처리장", "정화조관리층", "폐기물 보관시설")
    private val list운동시설 = listOf("위락시설", "철도시설", "운수시설", "철도청청사", "운동시설", "주민운동시설", "운동")
    private val list업무시설상업 = listOf("영업", "업무시설", "사무실", "공장", "사무소", "경비실", "일반업무시설", "관리사무소", "업무", "신문사", "주유소", "업무시설 외2", "수위실 및 창고", "소화물발송취급소", "사법인사무실", "도시형공장", "기타공장", "공장시설", "제조", "업무용시설", "공장", "오폐수처리장", "목조", "공판장", "아파트형공장", "일반공장", "도시형생활주택 및 업무시설", "가압펌프장", "음식물쓰레기처리시설", "사무실 및 근린생활시설", "업무시설 및 공동주택", "관리시설", "회의실", "업무시설 및 제2종근린생활시설", "사무소/제1", "쓰레기처리시설")
    private val list업무시설공공 = listOf("근린공공시설", "공공업무시설", "의사당", "공관", "주민자치센터")
    private val list숙박시설 = listOf("숙박시설", "여관", "관광숙박시설", "관광호텔", "호텔", "생활형숙박시설", "일반숙박시설", "숙영시설", "고시원", "생활숙박시설", "숙박실 여관", "숙박시설 및 제1", "가족호텔", "여인숙")
    private val list수련시설 = listOf("청소년수련관")
    private val list문화및집회시설 = listOf("문화및집회시설", "전시장", "미술관", "문화 및 집회시설", "체육관", "문화재", "서울역사", "지하광장", "전시시설", "강당", "관람집회시설", "문화집회시설", "문화및집회시설외4", "기타문화및집회시설", "유관순회관")
    private val list동물및식물관리시설 = listOf("간이도계장", "동물수위실")
    private val list단독주택 = listOf("단독주택", "본가", "단독", "단독주텍", "다기구용단독주택", "다가구용단독주태")
    private val list노유자시설 = listOf("노유자시설", "노인정", "경로당", "어린이집", "노인복지시설", "아동복지시설", "새마을유아원", "복지관", "복지회관", "유치원", "보육시설", "아동시설")
    private val list교정및군사시설 = listOf("교사", "학교", "교실", "간호학교", "기타학교")
    private val list교육연구시설 = listOf("교육연구시설", "교육연구및복지시설", "도서관", "창업지원센터", "DMS운영센터", "교육연구", "연극연구소", "교육 연구시설", "교육연구 및 복지시설", "교육관", "작은도서관")
    private val list관광휴게시설 = listOf("관광휴게시설")
    private val list공동주택 = listOf("주택", "공동주택", "다가구용단독주택", "다세대주택", "다가구주택", "연립주택", "다가구용 단독주택", "아파트", "협동주택", "도시형생활주택", "오피스텔", "다가구 주택", "다가구단독주택", "다가구형 단독주택", "다가구형단독주택", "다가구용주택", "다가구용 단독 주택", "오피스텔 및 다세대주택", "단지형다세대주택", "다가구용 주택", "다가구주택 및 근린생활시설", "다세대", "공동주택 및 제2종근린생활시설", "다가구주택및근린생활시설", "도시형생활주택단지형다세대주택", "다중생활시설", "주거용오피스텔", "다세대주택-도시형생활주택", "주택 및 근린생활시설", "단독형다가구주택", "다세대 주택", "다가구주택 및 제2종근린생활시설", "아파트 및 업무시설", "공동주택 및 사무소", "주", "다가구용 단독주텍", "점포 및 주택", "다가구주택 외1", "도시형생활주택단지형", "사무소 및 다세대주택", "다세대주택", "다세대주택/근린생활시설", "대세대주택", "청년주택", "다가구주택/근린생활시설", "공동", "다세대8가구 및 근린생활시설", "다가구", "다가구용", "주택 및 창고", "사무소/다세대주택", "다가구주택3가구", "공동주택", "도시형생활주택 단지형다세대주택", "도시형생활주택-원룸형29세대", "다가구주택-5가구/ 근린생활시설", "다가구 단독주택", "다가구주택 및 근생", "다가주주택", "다가구주택/2종근린생활시설", "다세대주택 및 근린생활시설", "단지형 다세대주택", "다세대주택 외1", "도시형 생활주택", "다세대주택 및 제2종근린생활시설", "공동주택[다세대주택", "다세대주택/1종근생", "다가구3가구", "다가구주택/근생", "다가구주택<4가구>", "다세대주택<10세대>", "다가구주택/제2종근린생활시설", "주거용 오피스텔", "오피스텔-33호", "도시형생활형주택", "오피스텔)", "아파트 및 오피스텔", "공동주택 외2", "오피스텔/다세대주택", "오피스텔 및 공동주택", "다세대주택/업무시설", "오피스텔및도시형생활주택", "다중주택", "다세대주택및근린생활시설", "기숙사", "숙사")

    fun check(bldUse: String): BldCategory {
        return if (list판매및영업시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.판매및영업시설
        } else if (list창고시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.창고시설
        } else if (list종교시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.종교시설
        } else if (list자동차관련시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.자동차관련시설
        } else if (list의료시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.의료시설
        } else if (list위험물저장및처리시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.위험물저장및쳐리시설
        } else if (list운동시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.운동시설
        } else if (list업무시설상업.any { bldUse.trim().startsWith(it) }) {
            BldCategory.업무시설상업
        } else if (list업무시설공공.any { bldUse.trim().startsWith(it) }) {
            BldCategory.업무시설공공
        } else if (list숙박시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.숙박시설
        } else if (list수련시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.수련시설
        } else if (list문화및집회시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.문화및집회시설
        } else if (list동물및식물관리시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.동물및식물관리시설
        } else if (list단독주택.any { bldUse.trim().startsWith(it) }) {
            BldCategory.단독주택
        } else if (list노유자시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.노유자시설
        } else if (list교정및군사시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.교정및군사설
        } else if (list교육연구시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.교육연구시설
        } else if (list관광휴게시설.any { bldUse.trim().startsWith(it) }) {
            BldCategory.관광휴게시설
        } else if (list공동주택.any { bldUse.trim().startsWith(it) }) {
            BldCategory.공동주택
        } else {
            BldCategory.Nothing
        }
    }
}

enum class BldCategory(val unitEnegryAmount: Double) {
    판매및영업시설(408.450),
    창고시설(0.0),
    종교시설(257.490),
    자동차관련시설(0.0),
    의료시설(643.520),
    위험물저장및쳐리시설(0.0),
    운동시설(235.420),
    업무시설상업(374.470),
    업무시설공공(371.660),
    숙박시설(526.550),
    수련시설(231.330),
    문화및집회시설(412.030),
    동물및식물관리시설(0.0),
    단독주택(0.0),
    노유자시설(175.580),
    교정및군사설(392.070),
    교육연구시설(231.330),
    관광휴게시설(437.080),
    공동주택(230.0),
    Nothing(0.0);


}